Revit 2027 API
TransferringProjectStandardsEventArgs.SetExternalItems Method
 Sets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetExternalItems(
	IDictionary<Guid, string> externalItems
)
Public Sub SetExternalItems (
	externalItems As IDictionary(Of Guid, String)
)
public:
void SetExternalItems(
	IDictionary<Guid, String^>^ externalItems
)
member SetExternalItems :
        externalItems : IDictionary<Guid, string> -> unit
Parameters
externalItems IDictionary<Guid, String>
 The external items which are displayed in the Transfer Project Standards UI. GUIDvalue is used to identify the external item string.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The externally added items that the user opted to transfer will be reported in the args to the TransferredProjectStandards event.
See Also
Reference
TransferringProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace